UN DATASET ASSIGNMENT QUESTIONS (WK1 - Python/Pandas):


Subset the combined data frame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

Create three new data frames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab for auto-complete options).

Which country had the lowest percentage of internet users in 2014? What was the percentage?

Repeat for 2004 and 2009.

Which country had the highest gdp per capita in 2014? What was the gdp per capita?

Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

Create some scatterplots:
a. 2004 Percent Using the Internet vs GDP Per Capita
b. 2009 Percent Using the Internet vs GDP Per Capita
c. 2014 Percent Using the Internet vs GDP Per Capita

Are there differences across years? What do the plots tell you about any relationship between these two variables? Enter your observations as a markdown cell.

Look at the distribution of gdp per capita values for 2014. Is it unimodal?

Look at the distribution of Internet Use for 2014. Is it unimodal?

What are the top 5 countries in terms of internet use in 2014?

Create a data frame called top_5_internet from the combined data frame that has all three years for these 5 countries. You should have 15 rows. Check that this is true. (TRICKY QUESTION PER MARY) - create new df, go back to one with 
all three yrs and filter to get those 3 yrs for these 5 countries, 15 rows, 3 cols for each of 3 countries

Create a seaborn FacetGrid to show the internet usage trend over time for these 5 countries (those with the highest reported internet use in 2014). Which country had the greatest growth between 2004 and 2014? Is there a plotting issue with Bermuda? Can you fix it?

Repeat the steps above to look at the trend for the 5 countries with the lowest 2014 internet usage. Which country has consistently had the least internet use?

Find the top 5 countries for 2014 in terms of GDP per capita; create a dataframe to look at 10-year trends (2004-2014, so we'll have 2004, 2009, 2014 in terms of trends) in gdp per capita for those 5 countries. Use a seaborn facet grid for this.

Repeat this one more time to look at 10-year trend for the bottom 5 countries for 2014 in terms of GDP per capita.

Is there anything surprising or unusual in any of these plots? Searching on the internet, can you find any possible explanations for unusual findings? check online for info

Bonus exercise:
Download another data set from the UN data (http://data.un.org/Explorer.aspx) to merge with your data and explore.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
## Q5: Using the pandas read_csv() function, read the GDP dataset into your notebook as a DataFrame called gdp_df.
## Take a look at the first 6 rows.

In [3]:
## used nrows to filter out rows past a certain count of rows
## then checked tail to make sure which row the data ended on
gdp_df = pd.read_csv('../data/gdp_percapita.csv', nrows = 6728)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [4]:
gdp_df.tail(6)

     Country or Area  Year        Value  Value Footnotes
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN

In [5]:
## Q6: Repeat for the internet use dataset. Call this DataFrame internet_df.
## Take a look at the first six rows.

In [6]:
## used nrows to filter out rows past a certain count of rows
## then checked tail to make sure which row the data ended on
internet_df = pd.read_csv('../data/internet_use.csv', nrows = 4495)
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [7]:
internet_df.tail(6)

     Country or Area  Year     Value  Value Footnotes
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [8]:
## Q7: Look at the shape of each dataframe - how many rows, how many columns.
## A7: GDP has (6731, 4), Internet has (4495,4)

In [9]:
gdp_df.shape

(6728, 4)

In [10]:
internet_df.shape

(4495, 4)

In [11]:
## Q8: Take a look at the data types for the columns in each table.

In [12]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [13]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [14]:
## Q9: Take a look at the last 10 rows of each dataset in turn.

In [15]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6718        Zimbabwe  2000  2945.993212              NaN
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN

In [16]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [17]:
## Q10: Drop the 'value footnotes' data (column) from both datasets. Check that this worked as expected.

In [18]:
gdp_df = gdp_df.drop(['Value Footnotes'], axis = 1)
gdp_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [19]:
internet_df = internet_df.drop(['Value Footnotes'], axis = 1)
internet_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [20]:
## Q11: Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [21]:
gdp_df.columns = ['Country', 'Year', 'GDP_Per_Capita']
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636
2  Afghanistan  2016     1757.023490
3  Afghanistan  2015     1766.593077
4  Afghanistan  2014     1795.735834

In [22]:
## Q12: Change the columns for the Internet Users data frame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [23]:
internet_df.columns = ['Country', 'Year', 'Internet_Users_Pct']
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

In [24]:
## Q13: Merge the two DataFrames to one. Merge all rows from each of the two DataFrames.
## Call the new DataFrame gdp_and_internet_use.

In [25]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, on = ['Country', 'Year'], how = 'outer')

In [26]:
## Q14: Look at the first five rows of your new data frame to confirm it merged correctly.

In [27]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

In [28]:
## Q15: Look at the last five rows to make sure the data is clean and as expected.

In [29]:
gdp_and_internet_use.tail()

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7700  Virgin Islands (U.S.)  1996             NaN            4.647186
7701  Virgin Islands (U.S.)  1995             NaN            2.801958
7702  Virgin Islands (U.S.)  1994             NaN            0.940645
7703  Virgin Islands (U.S.)  1990             NaN            0.000000
7704               Zimbabwe  1990             NaN            0.000000

In [30]:
## Q16: Subset the combined data frame to keep only the data for 2004, 2009, and 2014. 
## Check that this happened correctly.

In [31]:
year_list = ['2004', '2009', '2014']
gdp_and_internet_use = gdp_and_internet_use.query("Year in @year_list")
print(gdp_and_internet_use.shape)
gdp_and_internet_use.head()

(835, 4)

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
4   Afghanistan  2014     1795.735834            6.390000
9   Afghanistan  2009     1502.354073            3.550000
14  Afghanistan  2004     1025.208245            0.105809
21      Albania  2014    10700.993216           60.100000
26      Albania  2009     9525.377979           41.200000

In [32]:
## Q17: Create three new data frames, one for 2004, one for 2009, and one for 2014. 
## Give them meaningful names that aren't too long.

In [34]:
##THIS IS NOT RIGHT

##year_2004 = gdp_and_internet_use[description_counts.type_desc.str.contains('Building Residential')]
year_2004 = gdp_and_internet_use.Year == 2004
year_2004

4       False
9       False
14       True
21      False
26      False
        ...
7667    False
7672     True
7682    False
7687    False
7692     True
Name: Year, Length: 835, dtype: bool